[{"code":{"day":22,"month":2,"year":2025,"order":1},"note":"Nice day for fishing, ain't it? Ha-ha!","title":"Hello, have a nice day!","text":"This is a testing site, made for playing around!"},{"code":{"day":22,"month":2,"year":2025,"order":2},"note":"What comes around - goes around, like a record - right round, round, round~","title":"In terms of games","text":"Today I finished both games. I look forward to add them to the site. \n            Even if the second one is a bit harsh. Here I am also testng text wrapping \n            so don't be scared if the text suddenly goes brrr..."},{"code":{"day":23,"month":2,"year":2025,"order":1},"note":"The wisdom of the pool-senpai today is absent: full pool, you, fool","title":"In terms of time wasting","text":"I want an mmo game where I can hoard items"},{"code":{"day":24,"month":2,"year":2025,"order":1},"note":"A pope comes towards another pope...wait, I messed up language settings again","title":"Routes, routes...","text":"It is quite relatable matter, lol. Do not forget /* to keep your relations deep."},{"code":{"day":25,"month":2,"year":2025,"order":1},"note":"Did you know deer can jump higher than the average house? Yeah, you know where it goes.","title":"Bit by bit, step by step","text":"Changed little things, lighted up arrows in games, fixed there, cleaned here...\n        Actually, all previous puns created today kek. I need to create another one - so hard."},{"code":{"day":14,"month":3,"year":2025,"order":1},"note":"Covfefe","title":"I was ill","text":"But anyway I am on my legs once again and made fully adjustable, refresh-proof form for adding records. Hurray to me!"},{"title":"It is a test record","note":"I believe I could be flying now~ I believe I might have access to the sky sphere~","text":"Fully created, edited and deleted with my interface.\nBut actually, I need to test it more...///","code":{"day":3,"month":2,"year":2025,"order":0}},{"title":"I am very unhappy","note":"Do not dare to share your bear before it is at least mere fair","text":"I am not really getting the 'record-code' juggling between record component and delete warning. Urrgh. But instead I now know that for reversing records button I just need to trigger refresh without any changes in 'diary' so React would think that it is still the same entity and there is no need to recreate it, but will reverse it anyway.","code":{"day":3,"month":2,"year":2025,"order":1}},{"title":"Say, why is it 02 month, when it is 03?","note":"This field is actually not required","text":"Do not confuse .getDay() and .getDate(). Also, months are counted from 0.","code":{"day":3,"month":2,"year":2025,"order":2}},{"title":"Now I've collected them all!","note":"*tired pokemon noises","text":"I can add record, edit it, delete it! What a life! Should I also be able to export them? \nEvery time I make something good, new target appears.","code":{"day":19,"month":3,"year":2025,"order":0}},{"title":"Download function is here!","note":"There is no notes in Ba Sing Se","text":"And now I can do quick back-ups. The hard part is to make upload handler that is checking if the diary is not empty - and on every record decides what to do.","code":{"day":22,"month":3,"year":2025,"order":0}},{"title":"As you guessed, maxlength is unlimited.","note":"I feel myself bad today, so will write in small. Very busy week, and not to mention mental health. The sirens took their toll so I am very tired. The length of this field is limited only by its inconvenience to user, as I want to have freedom at least here.","text":"Should I limit it somewhere else? No!","code":{"day":25,"month":3,"year":2025,"order":0}},{"title":"Next ideas","note":"n0thing new","text":"Turned off autofilling input here.\n* change add VS edit here\n* add carpentory, but where...\n* check audio from bandcamp and forms there\n* add input types -let it go- style\n* learn SASS\n* add line break ability in the blog, this is ridiculous!","code":{"day":25,"month":3,"year":2025,"order":1}},{"title":"Added sass","note":"You would not find it yet!","text":"There is a secret page in this project, where I hold all my testing widgets hehehe (not yet tho)","code":{"day":26,"month":3,"year":2025,"order":0}},{"title":"Redacting buttons dissapeared!","note":"after Sass instalation.","text":"They somehow changed their color to white. WHY-te?","code":{"day":28,"month":3,"year":2025,"order":0}},{"title":"Making a normal project from ","note":"pain au chocolat~","text":"https://github.com/theothersarah/terra-invicta-techtree-update/tree/master  \n----\n\nhttps://sarahwatt.ca/terra-invicta/techtree-validation/#Project_EliteMarineAssaultUnit\n\n- It is still hard to, I am not used to decisions that the author made while making this project. \n\n","code":{"day":28,"month":3,"year":2025,"order":1}},{"title":"Decided to add conspectus to the site.","note":"That is the way","text":"Don't know is it necessary tho.","code":{"day":4,"month":4,"year":2025,"order":0}},{"title":"Finished with conspectus interface for now, filling in","note":"Saturday is Caturday","text":"Text goes here...","code":{"day":5,"month":4,"year":2025,"order":0}},{"title":"Search for git credentials helper","note":"No, just no","text":"Look what I generated in the /Users/ola/.ssh/id_rsa :second, get helper to help with pushes without every time typing the pass, add record to the AHOT and ROFA, and ROFE \n\n---\nPush changing in the learning (I want this green lights)\n---\nI also want my text to be styled in the BlogRecord and not this~\n---\nAlso, the buttons every time decide to disappear, went white. Fixing by page reload but this is nonsense!","code":{"day":6,"month":4,"year":2025,"order":0}},{"title":"Important link","note":"","text":"https://www.theserverside.com/blog/Coffee-Talk-Java-News-Stories-and-Opinions/GitHub-SSH-Key-Setup-Config-Ubuntu-Linux","code":{"day":6,"month":4,"year":2025,"order":1}},{"title":"Added github Pages","note":"Not everything that we see - isreal","text":"All images have gone. Even the button ones. But the edit and delete divs are on their places.","code":{"day":6,"month":4,"year":2025,"order":2}},{"title":"Fixes some warnings and errors","note":"Next - saving blog's text formatting","text":"Main one - Hash Router instead of Browser router. Second one - images URLs are now import.meta.url-based paths. Next ones - little warnings there and here, also added default message to the blog if there is no messages in diary yet or the diary length is 0.","code":{"day":7,"month":4,"year":2025,"order":0}},{"title":"Plans (max)","note":"You know that the list would have been looking better if I'd already made all the tasks from this list, yeah?","text":"Blog - save formatting from textarea to BlogRecord. Use special translator there and back. Make initial record edit window bigger.\nConspectus - downloading auto-generated PDF from all the lectures, or at least, some file.\nCarpenotory - working \"hold\" button and working player (only one playing track in the player, playing tracks, running track and album name, active track length tracking, embedding to the other web-pages).\nAdd links to the main resources to the main page with logos - behance, github, flaticon, ghatGpt, developer.mozilla.org, E3 or how it is called...GitHowTo. Add record backup to the git ignore and delete App, rename Sertar and change project tree to have Sertar outside. Make text decoration editor in the record edit window and add there checkboxes.\n\nAdapt the pages to the mobile version, from the mobile-first idea.\n\nMove the popupCurtain on the Sertar level (name it app and bring higher) - and translate the curtain state to the level below (blog).\n\nLevel all titles on the carpentory cards","code":{"day":9,"month":4,"year":2025,"order":0}},{"title":"New problem:","note":"As if I can have less of them...","text":"Now the header Router stopped working properly -  the URL is changing, but not the page content. It was working yesterday. On the GitHub Pages everything seems alright.\nStrange thing starts after opening blog page, and from main to the other modules it is working all-right.","code":{"day":9,"month":4,"year":2025,"order":1}},{"title":"Redo conspectus page","note":"to do, I was wrong lol","text":"to have Navbar with themes in the left and main container with their collapsable content on the center. \nAlso, I want to add lectures like in a blog AND be able to change text decorations.","code":{"day":9,"month":4,"year":2025,"order":2}},{"title":"Redo game page","note":"to do","text":"Add falling down menu on the left, save existing game field, mark on which game we are now in the menu, animate choosing next one or different one, fix clue on the monkey-do game, create default the style for Memory game that is more inline with apps one.","code":{"day":9,"month":4,"year":2025,"order":3}},{"title":"Blog refresh-proof states","note":"My creativity for notes is absent today....","text":"First time it is working ok, second time in a row - not. Also, I want to have \"this is a draft\" message, but today having a problem  with it.","code":{"day":14,"month":4,"year":2025,"order":0}},{"title":"Changed conspectus to router-like","note":"What can I say?~ What can I do?~","text":"Nav to the left, pages to the right.","code":{"day":16,"month":4,"year":2025,"order":0}},{"title":"Little changes","note":"done and also to do","text":"Saved editing saving mechs in blog, added logo-links to the main page, opened themes in conspectus are more noticable. \nNow all records in the blog are tabbable as also buttons to add/download/edit/delet. But they are not activatable yet. I think about changing them to buttons instead of divs - don't want to add a bunch of listeners.\n\nAdd pop up to close button on edit mode, to save draft or not on will.\n\nOn mobile version, I think, a record should become white on click, showing two big buttons in the middle - edit and delete. \nAm currently learning for the test.","code":{"day":8,"month":5,"year":2025,"order":0}},{"title":"Adjusted to the workshow","note":"I am too tired and sleepy, no jokes today. ","text":"As I started to search for work, even this little project should have been modified to be presentable. So I hid the conspectus part as well as changed greeting's page with announcement and changed useful links to mine - GitHub and LinkedIn. Later I noticed that as announcement take now more space than before - it triggers a navigation bar on the right for a second and when the announcement is on place and the bar is no longer needed so it hides, moving all the page to the side a little bit. Fixed height and added opacity.\nNow, The focusing part of the blog's button's css is messing with their active state - but I am sure, I know how to fix it.","code":{"day":22,"month":5,"year":2025,"order":0}},{"title":"Fixed buttons, new problem has come","note":"What does the blue curtain mean?","text":"Pop-up curtain hides a scroll bar on the right (if is visible on the page) but when there is no scroll bar - it is ok. So we don't have a preferred option. It needs to be the same as on the blog page.","code":{"day":22,"month":5,"year":2025,"order":1}}]